docs/envelope-nfce-test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
<soap12:Header>
<nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4">
<cUF>13</cUF>
<versaoDados>4.00</versaoDados>
</nfeCabecMsg>
</soap12:Header>
<soap12:Body>
<nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4">
<NFe xmlns="http://www.portalfiscal.inf.br/nfe">
<infNFe Id="NFe13202513026031805313900016900100000000110000" versao="4.00">
<ide>
<cUF>13</cUF>
<cNF>00000001</cNF>
<natOp>Venda</natOp>
<mod>65</mod>
<serie>1</serie>
<nNF>1</nNF>
<dhEmi>2025-10-27 19:42:05-03:00</dhEmi>
<tpNF>1</tpNF>
<idDest>1</idDest>
<cMunFG>1302603</cMunFG>
<tpImp>4</tpImp>
<tpEmis>1</tpEmis>
<cDV>0</cDV>
<tpAmb>1</tpAmb>
<procEmi>0</procEmi>
<verProc>1.0</verProc>
</ide>
<emit>
<CNPJ>18053139000169</CNPJ>
<xNome>LEAO DE JUDA SOLUCOES EM TECNOLOGIA EIRELI - ME</xNome>
<xFant>Teste</xFant>
<enderEmit>
<xLgr>Rua Ararangua</xLgr>
<nro>211</nro>
<xBairro>Centro</xBairro>
<cMun>1302603</cMun>
<xMun>Manaus</xMun>
<UF>AM</UF>
<CEP>69090786</CEP>
<cPais>1058</cPais>
<xPais>Brasil</xPais>
</enderEmit>
<IE>053374665</IE>
<CRT>1</CRT>
</emit>
<dest>
<CPF>12345678901</CPF>
<xNome>Cliente Teste</xNome>
</dest>
<det nItem="1">
<prod>
<cProd>001</cProd>
<cEAN>SEM GTIN</cEAN>
<xProd>Produto Teste</xProd>
<NCM>84713010</NCM>
<CFOP>5102</CFOP>
<uCom>UN</uCom>
<qCom>1.0000</qCom>
<vUnCom>100.00</vUnCom>
<vProd>100.00</vProd>
<cEANTrib>SEM GTIN</cEANTrib>
<uTrib>UN</uTrib>
<qTrib>1.0000</qTrib>
<vUnTrib>100.00</vUnTrib>
<indTot>1</indTot>
</prod>
<imposto>
<ICMS>
<ICMSSN102>
<orig>0</orig>
<CSOSN>102</CSOSN>
</ICMSSN102>
</ICMS>
<PIS>
<PISOutr>
<CST>99</CST>
<vBC>0.00</vBC>
<vPIS>0.00</vPIS>
</PISOutr>
</PIS>
<COFINS>
<COFINSOutr>
<CST>99</CST>
<vBC>0.00</vBC>
<vCOFINS>0.00</vCOFINS>
</COFINSOutr>
</COFINS>
</imposto>
</det>
<total>
<ICMSTot>
<vBC>0.00</vBC>
<vICMS>0.00</vICMS>
<vICMSDeson>0.00</vICMSDeson>
<vBCST>0.00</vBCST>
<vST>0.00</vST>
<vProd>100.00</vProd>
<vFrete>0.00</vFrete>
<vSeg>0.00</vSeg>
<vDesc>0.00</vDesc>
<vII>0.00</vII>
<vIPI>0.00</vIPI>
<vIPIDevol>0.00</vIPIDevol>
<vPIS>0.00</vPIS>
<vCOFINS>0.00</vCOFINS>
<vOutro>0.00</vOutro>
<vNF>100.00</vNF>
<vTotTrib>0.00</vTotTrib>
</ICMSTot>
</total>
<transp>
<modFrete>9</modFrete>
</transp>
<pag>
<detPag>
<tPag>01</tPag>
<vPag>100.00</vPag>
</detPag>
</pag>
<infIntermed>
<CNPJ>18053139000169</CNPJ>
<idCadIntTran>123456</idCadIntTran>
</infIntermed>
<infRespTec>
<CNPJ>18053139000169</CNPJ>
<xContato>Teste</xContato>
<email>teste@teste.com</email>
<fone>92999999999</fone>
</infRespTec>
<infNFeSupl>
<qrCode>https://nfce.sefaz.am.gov.br/qrcode?chNFe=13202513026031805313900016900100000000110000&nVersao=100&tpAmb=1&dhEmi=2025-10-27%2019%3A42%3A05-03%3A00&vNF=100.00&vICMS=0.00&digVal=&cIdToken=000001&cHashQRCode=6057b21251b1d64c76fd1ed3909b3fd5</qrCode>
</infNFeSupl>
</infNFe>
</NFe>
</nfeDadosMsg>
</soap12:Body>
</soap12:Envelope>